Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: akanyuunyambuzi
en: [GENERAL_NOUN] yellow oxalis

source: obunyuunyambuzi
en: [GENERAL_NOUN_PLURAL] yellow oxalises

source: kondomu
en: [GENERAL_NOUN] small ball, condom

source: kuondomu
en: [GENERAL_NOUN_PLURAL] small ball, condoms

source: akapimpina
en: [COMMON_ANIMALS_NOUN] chameleon

source: enyampimpina
en: [COMMON_ANIMALS_NOUN_PLURAL] chameleons

source: ekisirani
en: [GENERAL_NOUN] misfortune curse grumbling

source: akaronkoronko
en: [GENERAL_NOUN] trait of weakness

source: oburonkoronko
en: [GENERAL_NOUN_PLURAL] trait of weaknesses

source: akarorwaho
en: [GENERAL_NOUN] sign, symbol

source: oburorwaho
en: [GENERAL_NOUN_PLURAL] sign, symbols

source: akarumanfuuzi
en: [GENERAL_NOUN] tiny biting fly

source: oburumanfuuzi
en: [GENERAL_NOUN_PLURAL] tiny biting flies

source: akahumuza
en: [GENERAL_NOUN] a comma

source: obuhumuza
en: [GENERAL_NOUN_PLURAL] commas

source: akati kisoke
en: [GENERAL_NOUN] comb, hair brush

source: obuti bwisoke
en: [GENERAL_NOUN_PLURAL] comb, hair brushes

source: akasarre
en: [GENERAL_NOUN] danger, difficulty

source: obusarre
en: [GENERAL_NOUN_PLURAL] danger, difficulties

source: akasasamaro
en: [GENERAL_NOUN] greatcommotion, confusion

source: obusasamaro
en: [GENERAL_NOUN_PLURAL] greatcommotion, confusions

source: akasekende
en: [GENERAL_NOUN] shaker

source: obusekende
en: [GENERAL_NOUN_PLURAL] shakers

source: esigo
en: [GENERAL_NOUN] seed

source: akasiisira
en: [GENERAL_NOUN] make shift hut

source: obusiisira
en: [GENERAL_NOUN_PLURAL] make shift huts

source: akasondaburo
en: [GENERAL_NOUN] epiglottis

source: obusondaburo
en: [GENERAL_NOUN_PLURAL] epiglottises

source: akasolya
en: [GENERAL_NOUN] tip of a roof

source: obusolya
en: [GENERAL_NOUN_PLURAL] tip of a roofs

source: akasonga
en: [GENERAL_NOUN] tip of something

source: obusonga
en: [GENERAL_NOUN_PLURAL] tip of somethings

source: akasoono
en: [GENERAL_NOUN] enticement, persuasion

source: obusoono
en: [GENERAL_NOUN_PLURAL] enticement, persuasions

source: akasoonooki
en: [GENERAL_NOUN] morning sunshine

source: obusoonooki
en: [GENERAL_NOUN_PLURAL] morning sunshines

source: akasumi
en: [GENERAL_NOUN] time, season

source: obusumi
en: [GENERAL_NOUN_PLURAL] time, seasons

source: akasungu
en: [GENERAL_NOUN] a straw of grass

source: obusungu
en: [GENERAL_NOUN_PLURAL] straw of grasses

source: akaswa
en: [COMMON_ANIMALS_NOUN] small anthill

source: obuswa
en: [COMMON_ANIMALS_NOUN_PLURAL] small anthills

source: akataama
en: [COMMON_ANIMALS_NOUN] small sheep

source: obutaama
en: [COMMON_ANIMALS_NOUN_PLURAL] small sheeps

source: akatale
en: [GENERAL_NOUN] market

source: obutale
en: [GENERAL_NOUN_PLURAL] markets

source: akatambaara
en: [GENERAL_NOUN] handkerchief

source: obutambaara
en: [GENERAL_NOUN_PLURAL] handkerchiefs

source: akatiiko
en: [GENERAL_NOUN] newly found excitement

source: obutiiko
en: [GENERAL_NOUN_PLURAL] newly found excitements

source: akatimba
en: [GENERAL_NOUN] net, wire mesh

source: obutimba
en: [GENERAL_NOUN_PLURAL] net, wire meshes

source: akatongo
en: [GENERAL_NOUN] a thicket, small forest

source: obutongo
en: [GENERAL_NOUN_PLURAL] thicket, small forests

source: akatoonyezi
en: [GENERAL_NOUN] a dot, full stop

source: obutoonyezi
en: [GENERAL_NOUN_PLURAL] dot, full stops

source: akatunda
en: [GENERAL_NOUN] small passion fruit

source: obutunda
en: [GENERAL_NOUN_PLURAL] small passion fruits

source: akatunguru
en: [GENERAL_NOUN] an onion

source: obutunguru
en: [GENERAL_NOUN_PLURAL] onions

source: akatuzi
en: [GENERAL_NOUN] small mushroom

source: akawamuje
en: [COMMON_ANIMALS_NOUN] squirrel

source: obuwamuje
en: [COMMON_ANIMALS_NOUN_PLURAL] squirrels

source: akazingo
en: [GENERAL_NOUN] chronic

source: obuzingo
en: [GENERAL_NOUN_PLURAL] chronics

source: akamayiro
en: [GENERAL_NOUN] uncalled for familiarity

source: obumanyiro
en: [GENERAL_NOUN] something for emergency

source: alifabeti
en: [GENERAL_NOUN] alphabet

source: alipoota
en: [GENERAL_NOUN] report

source: amaani
en: [GENERAL_NOUN] strength,authority, violence, force

source: amabaale
en: [GENERAL_NOUN] stones

source: amabega
en: [GENERAL_NOUN] shoulders

source: amabeho
en: [GENERAL_NOUN] fresh air

source: amabingo
en: [GENERAL_NOUN] reeds, elephant grass

source: nyamunura
en: [GENERAL_NOUN] savouries, delicacies

source: entungo
en: [GENERAL_NOUN] sesame

source: amacu
en: [HEALTH_AND_MEDICINE_NOUN] asthma, bronchitis

source: amacumu
en: [GENERAL_NOUN] spears

source: amacunda
en: [GENERAL_NOUN] churned milk

source: amacwacwa
en: [GENERAL_NOUN] cunning, craft, wisdom

source: amacwanta
en: [GENERAL_NOUN] saliva, spittle

source: amadaara/amatembero
en: [GENERAL_NOUN] ladders, steps

source: amadinda
en: [GENERAL_NOUN] pleats

source: amaiso
en: [GENERAL_NOUN] eyes

source: amaduli
en: [GENERAL_NOUN] hemp seed

source: amaazi
en: [GENERAL_NOUN] faeces, excrement

source: obugumangaine
en: [GENERAL_NOUN] difficulty

source: amagana
en: [GENERAL_NOUN] hundred(100), wealth

source: amaganga/enkali ye'nte
en: [COMMON_ANIMALS_NOUN] urine of cattle

source: amaganya
en: [GENERAL_NOUN] grief

source: obwomezi
en: [GENERAL_NOUN] health, strength, life

source: ensigo ezakya muno
en: [GENERAL_NOUN] overflowing grains

source: amagaruka
en: [GENERAL_NOUN] return journey

source: amagenda
en: [GENERAL_VERB] going, an outward journey

source: amagesa
en: [GENERAL_NOUN] reaping

source: amagezi
en: [GENERAL_NOUN] wisdom

source: amagoba
en: [GENERAL_NOUN] profits

source: amagosi
en: [GENERAL_NOUN] testicles

source: amaguli
en: [GENERAL_NOUN] large granaries

source: amahanga
en: [GENERAL_NOUN] nations

source: amahano
en: [GENERAL_NOUN] wonders

source: amahembe
en: [GENERAL_NOUN] horns

source: amahuli
en: [GENERAL_NOUN] eggs

source: amahunge
en: [GENERAL_NOUN] Northwest wind

source: amakuru
en: [GENERAL_NOUN] news

source: amahurru
en: [GENERAL_NOUN] small royal drums

source: amairu
en: [GENERAL_NOUN] intense desire

source: amajabali
en: [GENERAL_NOUN] frayed, jagged edges

source: isoke/ ekyoya
en: [GENERAL_NOUN] hair

source: ahya
en: [GENERAL_VERB] to drive from lair

source: kutimba
en: [GENERAL_NOUN] decoration, adornment, exaggerations

source: amajenjeka
en: [GENERAL_VERB] to tie loosely

source: amajooba
en: [GENERAL_NOUN] red stitching, embroidery

source: amaka
en: [GENERAL_NOUN] homes, homestead

source: amakamo
en: [GENERAL_NOUN] curdled milk, junket

source: amakara
en: [GENERAL_NOUN] charcoal

source: akigarukwamu
en: [GENERAL_VERB] to answer, reply

source: amakebe
en: [GENERAL_NOUN] fat cheeks

source: amakendu
en: [GENERAL_NOUN] waist

source: amakerre
en: [GENERAL_NOUN] wild strawbberries

source: amakooti
en: [GENERAL_NOUN] round shoulders

source: amakune
en: [GENERAL_NOUN] hospitality

source: amakuura
en: [GENERAL_NOUN] in footmall

source: amakutu
en: [GENERAL_NOUN] short cut

source: amakuuma
en: [GENERAL_NOUN] round shoulders

source: amakuumuule
en: [GENERAL_NOUN] rudeness

source: amalebe
en: [GENERAL_NOUN] water lilies

source: amalere
en: [GENERAL_NOUN] fern

source: amaligisa
en: [GENERAL_NOUN] over doing, exaggeration

source: amaryo
en: [GENERAL_NOUN] cunning, craft

source: amambukiro
en: [TRANSPORT_NOUN] ford, landing site

source: kujwaha
en: [GENERAL_VERB] to be exhausted

source: kuraranja
en: [GENERAL_VERB] to scatter, exhaust

source: amanambo
en: [GENERAL_NOUN] old mines

source: amananu/amazima
en: [GENERAL_NOUN] truth

source: amanda
en: [GENERAL_NOUN] hot charcoal, coals, charcoal

source: amanduguya
en: [HEALTH_AND_MEDICINE_NOUN] mumps

source: amankwaha
en: [GENERAL_NOUN] armpits

source: amanogo
en: [GENERAL_NOUN] tunnels made by termites

source: amanono
en: [GENERAL_NOUN] claws of an animal

source: amanyaali
en: [GENERAL_NOUN] semen

source: obufuki
en: [GENERAL_NOUN] damp, cold

source: amanzamba
en: [GENERAL_NOUN] cartridge bolt

source: ebyenda
en: [GENERAL_NOUN] bowels, small intenstines

source: amaraka
en: [GENERAL_NOUN] voices, throat, larynx

source: amarali
en: [GENERAL_NOUN] squint, cross-eyes

source: angaarra
en: [GENERAL_VERB] to be left friendless

source: kwangana
en: [GENERAL_NOUN] divorce

source: kuterangana
en: [GENERAL_VERB] to bate each other

source: kwangasana
en: [GENERAL_VERB] to shine

source: kwanguha
en: [GENERAL_VERB] to be quick

source: kwanguhya
en: [GENERAL_VERB] to hasten, accelerate

source: kwomesereza
en: [GENERAL_VERB] to dry slowly

source: kwana
en: [GENERAL_VERB] to make, to bear(fruit)

source: kujara
en: [GENERAL_VERB] to spread out

source: anjuka
en: [GENERAL_VERB] to be lascivious, licentious

source: anjura
en: [GENERAL_VERB] to make lascivious, licentious

source: kujingajinga
en: [GENERAL_NOUN] forge

source: kusukura
en: [GENERAL_VERB] to open (book)

source: kujanjaza
en: [GENERAL_VERB] to be spread, furnished

source: kwasama
en: [GENERAL_VERB] to open (of mouth)

source: kuhonda
en: [GENERAL_VERB] to crush, pound

source: kwatura
en: [GENERAL_VERB] to hatch out

source: amaranga
en: [GENERAL_NOUN] type of lilies

source: emyempanko
en: [GENERAL_NOUN] pride

source: amarunga
en: [GENERAL_NOUN] scarlet seeds

source: amasamba
en: [GENERAL_NOUN] estates, plantations

source: amakamba
en: [GENERAL_NOUN] latex of rubber tree

source: amasanga
en: [GENERAL_NOUN] ivory, tusks

source: amasanyu
en: [GENERAL_NOUN] leafy twigs, foliage

source: amasasaazi
en: [GENERAL_NOUN] sparks

source: amasasi
en: [GENERAL_NOUN] bullets

source: amasirimuko
en: [GENERAL_NOUN] descent, slope,south

source: amasonsolya
en: [GENERAL_NOUN] top of a tree

source: amasu
en: [GENERAL_NOUN] loneliness, solitude

source: amasumi
en: [GENERAL_NOUN] fresh milk

source: amasurubbu
en: [GENERAL_NOUN] whiskers

source: amaswale
en: [GENERAL_NOUN] raffia

source: amata
en: [GENERAL_NOUN] milk

source: amatandiiko
en: [GENERAL_NOUN] harness, saddle

source: amatanga/ebiraka
en: [GENERAL_NOUN] patches

source: amatangatangano
en: [GENERAL_NOUN] cross-roads, junction

source: amatu
en: [GENERAL_NOUN] ears

source: amatu g'abakaikuru
en: [GENERAL_NOUN] fungus found on trees

source: amazaarwa
en: [GENERAL_NOUN] birthday

source: amazi
en: [GENERAL_NOUN] dung, feaces,stool

source: amaziga
en: [GENERAL_NOUN] tears

source: amazima
en: [GENERAL_NOUN] truth

source: amoogi
en: [GENERAL_NOUN] sharpness

source: amooya
en: [GENERAL_NOUN] feathers/hair

source: ange
en: [GENERAL_NOUN] mine

source: ekigarukyamu
en: [GENERAL_NOUN] answer

source: arukwiragura
en: [GENERAL_NOUN] black, black person

source: kyawe
en: [GENERAL_NOUN] yours

source: kwata mungaro
en: [GENERAL_VERB] to catchin the hands

source: abanyabuzale
en: [GENERAL_NOUN] relatives

source: kulima mporampora
en: [GENERAL_VERB] to dig over lightly

source: abazini
en: [GENERAL_NOUN] chorus, choir

source: kirungi
en: [GENERAL_NOUN] bleached calico (best quality)

source: kubazisa ekiniga
en: [GENERAL_VERB] speak loudly with anger

source: baamya
en: [GENERAL_NOUN] okra

source: bachwezi
en: [MILITARY_NOUN] demi-god, soldier

source: bagaya
en: [GENERAL_NOUN] they despise

source: abalimisa no'bulisa
en: [GENERAL_NOUN] agricultural people and artisans

source: bahima
en: [GENERAL_NOUN] pastoralists

source: bahuma
en: [COMMON_ANIMALS_NOUN] pastroral cow-men

source: bakisaagya
en: [GENERAL_NOUN] beyond expectation

source: bakura
en: [GENERAL_VERB] to seize on, catch

source: kwatwa omuro
en: [GENERAL_VERB] to catch fire (house)

source: Baraza
en: [GENERAL_NOUN] Monday

source: embalira
en: [GENERAL_VERB] to estimate, budget, calculate

source: kusemererwa
en: [GENERAL_VERB] to be joyfu

source: bambatara
en: [GENERAL_VERB] to be squashed (soil)

source: bambataza
en: [GENERAL_VERB] to squash

source: kuhikiriza
en: [GENERAL_VERB] to fulfill

source: kwimukya
en: [GENERAL_VERB] to lift up, raise

source: banganira
en: [GENERAL_VERB] to belp

source: bankizaki
en: [GENERAL_NOUN] large purple orchid

source: bara
en: [GENERAL_VERB] to count,calculate

source: Barozi
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] a governor

source: batiza
en: [GENERAL_VERB] to baptize

source: baza
en: [GENERAL_VERB] to talk

source: baziira
en: [GENERAL_VERB] to sew

source: bbaama
en: [GENERAL_VERB] to be bent, warped

source: bbaamuura
en: [GENERAL_VERB] to straighten, unbend

source: bbaamya
en: [GENERAL_VERB] to make crooked, warp

source: ebaasa
en: [GENERAL_NOUN] envelope

source: bbamu
en: [GENERAL_NOUN] intensive with

source: bbamuka/kugwamu
en: [GENERAL_VERB] to come unexpectedly

source: banyamalindwa
en: [GENERAL_NOUN] guardians of others' flocks

source: bbani/oruhu
en: [COMMON_ANIMALS_NOUN] buffalo hide

source: bbanka
en: [GENERAL_NOUN] bank

source: bbanura
en: [GENERAL_VERB] to dash down

source: bbaraza
en: [GENERAL_NOUN] council

source: bbaruka
en: [GENERAL_VERB] to burst

source: bbasitooro
en: [GENERAL_NOUN] pistol, revolver

source: bbeeru
en: [GENERAL_NOUN] flag. Banner, sail

source: bbeeseni/bafu
en: [GENERAL_NOUN] basin

source: bbinika
en: [GENERAL_NOUN] kettle

source: bbomba
en: [GENERAL_NOUN] bicycle pump

source: kukaba
en: [GENERAL_VERB] to collapse completely

source: empanga
en: [GENERAL_NOUN] dig deep

source: bbuukura
en: [GENERAL_NOUN] roar

source: bbwarruza
en: [GENERAL_NOUN] crunch, snap

source: beene
en: [GENERAL_NOUN] relative

source: begebege
en: [GENERAL_NOUN] food, portion out

source: bembeka
en: [GENERAL_NOUN] walk on heels

source: beregesa
en: [GENERAL_VERB] to talk very fast

source: bibugo
en: [GENERAL_NOUN] grave clothes

source: bicoboyo
en: [GENERAL_NOUN] young beans

source: bicucuke
en: [GENERAL_NOUN] dust. Rubbish

source: bicwe
en: [GENERAL_NOUN] broth

source: bicwereriirwe
en: [GENERAL_NOUN] invited thing

source: bifu
en: [GENERAL_NOUN] dead goats;rotten seeds

source: bifunjo
en: [GENERAL_NOUN] papyrus

source: bigene
en: [GENERAL_NOUN] entertaining conversation

source: bigenge
en: [HEALTH_AND_MEDICINE_NOUN] leprosy

source: bigesera
en: [GENERAL_NOUN] hair plaited style

source: bigesero
en: [GENERAL_NOUN] stubble, straw

source: bigondonka
en: [GENERAL_NOUN] happenings, occurrences

source: bigono
en: [GENERAL_NOUN] snoring

source: bigoye
en: [GENERAL_NOUN] recover

source: biguuna
en: [GENERAL_NOUN] ring conn

source: bihaarro
en: [GENERAL_NOUN] (used only inpl.fonn)

source: bihana
en: [GENERAL_NOUN] dyspepsia pains

source: bibaniirro
en: [GENERAL_NOUN] warning, caution

source: bihunda
en: [GENERAL_NOUN] rubbish, refuse

source: bihwa
en: [GENERAL_NOUN] whispered words

source: biihabiiha
en: [GENERAL_VERB] to entice, seduce

source: bire
en: [GENERAL_NOUN] bad, ugly

source: biihirwa
en: [GENERAL_VERB] be vexed, annoyed, troubled

source: biikiza
en: [GENERAL_VERB] to set down

source: bijaga
en: [HEALTH_AND_MEDICINE_NOUN] severe chronic syphilis

source: bijwajwa
en: [GENERAL_NOUN] saliva, dribble

source: bijwenge
en: [GENERAL_NOUN] long thick hair; fringe

source: bika
en: [GENERAL_NOUN] announce the death

source: bikaiga
en: [GENERAL_NOUN] young beans

source: bikambi
en: [GENERAL_NOUN] dregs,refuse, rubbish

source: bikaogaara
en: [GENERAL_NOUN] old leaves of herbs

source: bikangaarra
en: [BIOLOGY_NOUN] skeleton

source: bikaoja
en: [GENERAL_NOUN] dregs of beer

source: bikanka
en: [GENERAL_NOUN] make threats

source: bikeerranwa
en: [GENERAL_NOUN] waning moon

source: biko
en: [GENERAL_NOUN] leaves of omuko tree

source: bikoora
en: [GENERAL_NOUN] leaves, runners, dry tobaco

source: bikoorro
en: [GENERAL_NOUN] sputum

source: bikuti
en: [GENERAL_NOUN] middle husk of millet

source: Bikwebe
en: [GENERAL_NOUN] a response

source: bikya
en: [GENERAL_NOUN] neck

source: brmira
en: [GENERAL_NOUN] mucus of the nose

source: bimwemwe
en: [GENERAL_NOUN] smile

source: bimira
en: [GENERAL_NOUN] mucus of tbe nose

source: binda
en: [GENERAL_VERB] to wear a loin-cloth

source: binkuti
en: [GENERAL_NOUN] force a laugh

source: binkwabwa
en: [GENERAL_NOUN] hair in the armpits

source: bintu
en: [GENERAL_NOUN] things,wealth

source: binyansi
en: [GENERAL_NOUN] weeds; worms

source: binyoobwa
en: [GENERAL_NOUN] ground outs

source: binzaah
en: [GENERAL_NOUN] curry powder

source: biraapara
en: [GENERAL_NOUN] hurriedly

source: birerya
en: [GENERAL_NOUN] husks of simsim

source: birezi
en: [GENERAL_NOUN] secretion from eyes

source: biri
en: [GENERAL_NOUN] root, two

source: biriibwa
en: [GENERAL_NOUN] eatables, food

source: biriirra
en: [GENERAL_VERB] to discharge, water (eyes)

source: birika
en: [GENERAL_NOUN] snow

source: birikiirra
en: [GENERAL_NOUN] accuse, tell tales about

source: biro
en: [GENERAL_NOUN] days; periods

source: oturo
en: [GENERAL_NOUN] sleepiness in the eyes

source: birungo
en: [GENERAL_NOUN] seasoning,spices

source: birusu
en: [GENERAL_NOUN] saliva

source: bisa
en: [HEALTH_AND_MEDICINE_NOUN] labour pains

source: mabingo
en: [GENERAL_NOUN] young reed

source: bisajwa
en: [GENERAL_NOUN] fat of animals

source: bisaka
en: [GENERAL_NOUN] herbal medicine

source: bisanku
en: [COMMON_ANIMALS_NOUN] dry cow dung

source: biseereere
en: [GENERAL_NOUN] beans

source: bisengere
en: [GENERAL_NOUN] ironstone, dross, slag

source: bisi
en: [GENERAL_NOUN] raw, uncooked, unripe, fresh

source: bisonde
en: [HEALTH_AND_MEDICINE_NOUN] syphilis, yaws

source: bisokoro
en: [GENERAL_NOUN] leaves of young beans

source: bisoodo
en: [GENERAL_NOUN] fowls' dung, birds' droppings

source: bisuba
en: [GENERAL_NOUN] lies, deceit

source: Bisuma
en: [ASTRONOMY_AND_THE_UNIVERSE_NOUN] the Great Bear, Constellation

source: bisunga
en: [GENERAL_NOUN] husks, shavings, refuse

source: bisuni
en: [COMMON_ANIMALS_NOUN] variola, chicken pox

source: bisiyaga
en: [GENERAL_NOUN] sodomy

source: bitaigi
en: [GENERAL_NOUN] maizebefore it is fully-grown

source: bitanaki
en: [GENERAL_NOUN] vomit

source: bitanta
en: [GENERAL_NOUN] labia

source: bitaarra
en: [GENERAL_NOUN] whiskers

source: bitege
en: [GENERAL_NOUN] bandy legs

source: bitengo
en: [GENERAL_NOUN] ragged clothes or skins

source: bitontoorro
en: [GENERAL_NOUN] birds' dropping

source: biyaga
en: [GENERAL_NOUN] addled infertile eggs

source: biyogoma
en: [GENERAL_NOUN] flop down

source: boba
en: [GENERAL_NOUN] ja kcal, fox

source: boha
en: [GENERAL_VERB] to fasten, tie up

source: boboorra
en: [GENERAL_NOUN] unfasten

source: bohorrooka
en: [GENERAL_VERB] to unfasten

source: kunyeta
en: [GENERAL_VERB] to be fat

source: boigora
en: [GENERAL_VERB] to bark; speak roughly

source: bomwiboolezo
en: [GENERAL_NOUN] market toll collectors

source: bona
en: [GENERAL_NOUN] experience (trouble, etc.)

source: bonabona
en: [GENERAL_NOUN] suffer

source: bonabonesa
en: [GENERAL_VERB] to make one suffer

source: bondeerra
en: [GENERAL_NOUN] forge, to dissolv

source: bonekera
en: [GENERAL_VERB] to appear to

source: bonesa
en: [GENERAL_VERB] to hurt, punish

source: boobeera
en: [GENERAL_VERB] to be thoroughly cooked

source: boroogo
en: [GENERAL_NOUN] wailing,lamentation

source: boyera
en: [GENERAL_VERB] to quarrel with, attack

source: boyerangana
en: [GENERAL_VERB] to attack eachother

source: boyesa
en: [GENERAL_NOUN] scent, perfume

source: bubaagi
en: [GENERAL_NOUN] flaying

source: bubaizi
en: [GENERAL_NOUN] carpentry, joinery

source: bubaliirizi
en: [ECONOMICS_AND_COMMERCE_NOUN] economy.stinginess

source: bubambaazi
en: [GENERAL_NOUN] mad behavior

source: bubbaani
en: [BIOLOGY_NOUN] species of resin, incense

source: bubi
en: [GENERAL_NOUN] evil, harm;excrement

source: bubitihi
en: [GENERAL_NOUN] lying, deceitfulness

source: buboijana
en: [GENERAL_NOUN] loneliness, friendlessness, solitude

source: bubu
en: [GENERAL_NOUN] large edible mushroom

source: bubuura
en: [GENERAL_NOUN] loneliness solitude

source: buceke
en: [GENERAL_NOUN] weakness,feebleness

source: buculeezi
en: [GENERAL_NOUN] humility,meekness, docil ity, gentleness

source: bucwangya
en: [GENERAL_NOUN] deceit,fraud

source: bucwekaih
en: [GENERAL_NOUN] loss of children, bereavement

source: buda
en: [GENERAL_VERB] to knead (cooked plantains)

source: budaida
en: [GENERAL_NOUN] ceaselessly

source: budomadoma
en: [GENERAL_VERB] to folly

source: budongo
en: [GENERAL_NOUN] mud, mortar,clay for building

source: budoolidooli
en: [GENERAL_NOUN] little, tinny

source: buduupe
en: [GENERAL_NOUN] cunning,craftiness

source: buduuzi
en: [GENERAL_NOUN] scorn, derision

source: bufaakatr
en: [GENERAL_NOUN] widowhood

source: bufu
en: [GENERAL_NOUN] greediness,selfishness

source: bufuoda
en: [GENERAL_NOUN] narrowness,compression

source: bufuodaano
en: [GENERAL_NOUN] suffocation, stifling,asphyx

source: bufuuhi
en: [GENERAL_NOUN] jealousy

source: bugaajuki
en: [GENERAL_NOUN] redness

source: bugabe
en: [GENERAL_NOUN] freedom,right

source: bugabi
en: [GENERAL_NOUN] generosity,booty

source: bugabuga
en: [GENERAL_VERB] to be near death

source: bugambirambere
en: [GENERAL_NOUN] talk at random

source: bugana
en: [GENERAL_NOUN] at liberty

source: buganiza
en: [GENERAL_VERB] to clasp

source: buga.njaine
en: [GENERAL_NOUN] friendship, affection

source: buganjani
en: [GENERAL_NOUN] forch

source: buganyizi
en: [GENERAL_NOUN] pity, mercy

source: buganzi
en: [GENERAL_NOUN] affection,favoritism

source: bugeoyi
en: [GENERAL_NOUN] feast

source: bugeregere
en: [GENERAL_NOUN] sores between the toes

source: bugizi
en: [GENERAL_NOUN] ability, power

source: bugobya
en: [GENERAL_NOUN] deceit, fraud,hypocrisy

source: bugoga
en: [GENERAL_NOUN] nature,disposition. Way etc

source: bugoigo
en: [GENERAL_NOUN] sisal, hemp

source: bugole
en: [GENERAL_NOUN] wedding

source: bugoorra
en: [GENERAL_NOUN] African eggplant, Solanum Macrocarpan

source: kusetura
en: [COMMON_ANIMALS_NOUN] feed (cattle) early

source: bugumangani
en: [GENERAL_NOUN] stiffness, fimmess, hardness, rigidness

source: bugumba
en: [GENERAL_NOUN] barrenness, sterility

source: bubudamo
en: [GENERAL_NOUN] reliance,security, strength, refuge

source: bugumizo
en: [GENERAL_NOUN] forge

source: buguniiriza
en: [GENERAL_NOUN] stubbornness

source: bugunule
en: [GENERAL_NOUN] insolence

source: bugurusi
en: [GENERAL_NOUN] old age

source: buguta
en: [GENERAL_VERB] to rustle

source: buguuda
en: [GENERAL_NOUN] wealth, riches

source: buguzi
en: [GENERAL_NOUN] merchandise

source: bugwagwa
en: [GENERAL_NOUN] foolishness

source: bugweterano
en: [GENERAL_NOUN] inheritance, succession

source: bugwetwa
en: [GENERAL_NOUN] inheritedproperty

source: busa
en: [GENERAL_NOUN] for nothing

source: buhaba
en: [GENERAL_NOUN] folly

source: buhambirize
en: [GENERAL_NOUN] force,compulsion

source: buhamizo
en: [GENERAL_NOUN] stronghold,support, influence

source: bubaodiike
en: [GENERAL_NOUN] written matter, correspondence

source: buhanga
en: [GEOGRAPHY_NOUN] distant country

source: bubangaazi
en: [GENERAL_NOUN] longevity, durability

source: buhangami
en: [GENERAL_NOUN] scarcity

source: buhangirizi
en: [GENERAL_NOUN] slander

source: buhango
en: [GENERAL_NOUN] weight, size, bulk

source: buhangwa
en: [GENERAL_NOUN] inherent,nature

source: buhara
en: [GENERAL_NOUN] girlhood,maidenhood

source: buhate
en: [GENERAL_NOUN] spitefulness

source: buheereza
en: [GENERAL_NOUN] service

source: buhemu
en: [GENERAL_NOUN] shame, disgrace

source: bubendeke
en: [GENERAL_NOUN] fracture,sprain

source: buhere
en: [HEALTH_AND_MEDICINE_NOUN] scabies. The itch

source: bu hiire
en: [GENERAL_NOUN] good fortune, prosperity, success

source: buhoogozi
en: [GENERAL_NOUN] extortion,rapine, plunder, fraud

source: buhoole
en: [GENERAL_NOUN] insolence,self-wi ll, naughtiness, profligacy

source: buhulizi
en: [GENERAL_NOUN] order,discipline, obedience

source: buhumbe
en: [GENERAL_NOUN] multitude, crowd; delicacy

source: buhu nga
en: [GENERAL_NOUN] flour

source: bubungu
en: [GENERAL_NOUN] folly,indecency

source: bobuta
en: [GENERAL_NOUN] wound,injury

source: buhuuhirizi
en: [NATURE_AND_ENVIRONMENT_NOUN] fine rain,drizzle

source: bubwite
en: [GENERAL_NOUN] senility, senile, decay
